// Задание 1
// Необходимо создать переменную, в которой будет храниться температура в градусах Цельсия.
// Преобразовать значение в температуру по Фаренгейту.
// Формула перевода градусов Цельсия в градусы Фаренгейта:
// градусы Фаренгейта = (9 / 5) * градусы Цельсия + 32
// Вывести в консоль температуру в Цельсиях и Фаренгейтах.

let celsius = 20;
console.log(celsius, celsius * 9 / 2 + 32);


// Задание 2
// Необходимо создать переменную name, записать в эту переменную свое имя.
// Необходимо также создать переменную admin и присвоить этой переменной значение
// из переменной name.
// Вывести значение переменной admin в консоль.

let firstName = 'Лилия';
let admin = firstName;
console.log(admin);
